# 도서 데이터를 통한 SVD(Latent Factor ver)
Kaggle의 도서 데이터를 바탕으로 유저에게 새로운 도서를 추천하는 추천 시스템을 만들어보고자 한다.

In [1]:
import pandas as pd

In [2]:
books = pd.read_csv('C:/Users/USER/Desktop/RecommenderSystem/book_practice/books.csv')
ratings = pd.read_csv('C:/Users/USER/Desktop/RecommenderSystem/book_practice/ratings.csv')
users = pd.read_csv('C:/Users/USER/Desktop/RecommenderSystem/book_practice/users.csv')

C:\Users\USER\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [3]:
users

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

## Data_처리

In [4]:
books

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...
...,...,...,...,...,...,...,...,...
271355,0440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm),http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...
271356,0525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...
271357,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...
271358,0192126040,Republic (World's Classics),Plato,1996,Oxford University Press,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...
271359,0767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...

In [5]:
# isbn, 책 제목, 저자, 년도, 출판사 정보만 남긴다.
books = books.iloc[:,0:4]

In [6]:
# 컬럼명을 편하게 변경
books.columns = ['ISBN', 'title', 'author', 'pub_year']

In [7]:
books.isna().sum()

ISBN        0
title       0
author      1
pub_year    0
dtype: int64

In [8]:
users

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

In [9]:
# user 나이에 Nan이 많이 보인다. 연령대별로 어떤 책을 좋아하는지도 볼 수 있으니 나이를 쓸 수 있을지를 확인해보자.
users.isna().sum()

User-ID          0
Location         0
Age         110762
dtype: int64

In [10]:
# location의 경우 마지막의 국가만 활용해보려고 한다.
def cut_loc(loc):
    loc_cut_list = list(loc.split(', '))
    return loc_cut_list[-1]

In [11]:
users['country'] = users['Location'].apply(lambda x : cut_loc(x))

In [12]:
users

        User-ID                            Location   Age         country
0             1                  nyc, new york, usa   NaN             usa
1             2           stockton, california, usa  18.0             usa
2             3     moscow, yukon territory, russia   NaN          russia
3             4           porto, v.n.gaia, portugal  17.0        portugal
4             5  farnborough, hants, united kingdom   NaN  united kingdom
...         ...                                 ...   ...             ...
278853   278854               portland, oregon, usa   NaN             usa
278854   278855  tacoma, washington, united kingdom  50.0  united kingdom
278855   278856           brampton, ontario, canada   NaN          canada
278856   278857           knoxville, tennessee, usa   NaN             usa
278857   278858                dublin, n/a, ireland   NaN         ireland

[278858 rows x 4 columns]

In [13]:
users = users.drop('Location', axis = 1)
users.columns = ['user_id', 'age', 'country']

In [14]:
users.isna().sum()

user_id         0
age        110762
country         0
dtype: int64

In [15]:
users.dtypes

user_id      int64
age        float64
country     object
dtype: object

In [16]:
def age_to_gen(age):
    if age == 0:
        age = 'unknown'
    elif age < 10:
        age = 'under_10'
    elif age < 20:
        age = '10s'
    elif age < 30:
        age = '20s'
    elif age < 40:
        age = '30s'
    elif age < 50:
        age = '40s'
    elif age < 60:
        age = '50s'
    else:
        age = 'over_60'
  
    return age

In [17]:
users.age.fillna(0, inplace = True)
users['gen'] = users['age'].apply(lambda x : age_to_gen(x))

In [18]:
users

        user_id   age         country      gen
0             1   0.0             usa  unknown
1             2  18.0             usa      10s
2             3   0.0          russia  unknown
3             4  17.0        portugal      10s
4             5   0.0  united kingdom  unknown
...         ...   ...             ...      ...
278853   278854   0.0             usa  unknown
278854   278855  50.0  united kingdom      50s
278855   278856   0.0          canada  unknown
278856   278857   0.0             usa  unknown
278857   278858   0.0         ireland  unknown

[278858 rows x 4 columns]

In [19]:
ratings

         User-ID         ISBN  Book-Rating
0         276725   034545104X            0
1         276726   0155061224            5
2         276727   0446520802            0
3         276729   052165615X            3
4         276729   0521795028            6
...          ...          ...          ...
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[1149780 rows x 3 columns]

In [20]:
ratings.columns = ['user_id', 'ISBN', 'score']

In [21]:
# Pandas의 오픈 issue로 인해 해당 내용은 진행 불가
# rating_table = ratings.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score']
# https://github.com/pandas-dev/pandas/issues/10582

In [22]:
# 위의 문제 해결을 위해, ratings를 쪼개서 만들고자 한다.
# 비슷한 유저군들끼리 묶기 위해 gen별로 table을 만들어 진행한다.
ratings_with_gen = pd.merge(ratings, users[['user_id', 'gen']],
                           left_on='user_id', right_on='user_id', how = 'left')
ratings_with_gen

         user_id         ISBN  score      gen
0         276725   034545104X      0  unknown
1         276726   0155061224      5  unknown
2         276727   0446520802      0      10s
3         276729   052165615X      3      10s
4         276729   0521795028      6      10s
...          ...          ...    ...      ...
1149775   276704   1563526298      9  unknown
1149776   276706   0679447156      0      10s
1149777   276709   0515107662     10      30s
1149778   276721   0590442449     10      10s
1149779   276723  05162443314      8      10s

[1149780 rows x 4 columns]

연령대를 확인 후 연령대별 추천 도서를 만들어주고자 한다.
따라서 연령별로 데이터를 나누자.

In [23]:
ratings_under_10= ratings_with_gen.loc[ratings_with_gen.gen == 'under_10',:].reset_index(drop = True)
ratings_10s = ratings_with_gen.loc[ratings_with_gen.gen == '10s',:].reset_index(drop = True)
ratings_20s = ratings_with_gen.loc[ratings_with_gen.gen == '20s',:].reset_index(drop = True)
ratings_30s = ratings_with_gen.loc[ratings_with_gen.gen == '30s',:].reset_index(drop = True)
ratings_40s = ratings_with_gen.loc[ratings_with_gen.gen == '40s',:].reset_index(drop = True)
ratings_50s = ratings_with_gen.loc[ratings_with_gen.gen == '50s',:].reset_index(drop = True)
ratings_over_60 = ratings_with_gen.loc[ratings_with_gen.gen == 'over_60',:].reset_index(drop = True)

In [24]:
# rating_table_under_10 = ratings_under_10.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_10s = ratings_10s.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_20s = ratings_20s.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_30s = ratings_30s.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_40s = ratings_40s.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_50s = ratings_50s.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])
# rating_table_over_60 = ratings_over_60.pivot_table(index = ['user_id'], columns = ['ISBN'], values = ['score'])

## 모델 스케치(20대 기준)

모델의 스케치를 위해 20대를 예로 방법을 간단하게 확인해보자.

In [25]:
rating_table_20s = pd.pivot_table(ratings_20s, index = 'user_id', columns = 'ISBN', values = 'score').fillna(0)

In [26]:
rating_table_20s

ISBN,+0451197399,0 14 02.9640,0 907 062 008,0/330/25864/8,00000000,000000000,0000000000,00000000000,0000000000000,0000000010,...,Q552146269,ULLSTEINBUCHN,V16382000,VENAFRO001,VG3862004,X000000000,"\0432534220\""""","\0679751521""",`3502103682,Ô½crosoft
user_id,,,,,,,,,,,,,,,,,,,,,
10,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
36,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
56,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
79,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
92,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
278747,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
278843,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
278844,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
278846,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
278849,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [27]:
# 평균 정렬
import numpy as np
matrix_20s = np.matrix(rating_table_20s)
user_mean = np.mean(matrix_20s, axis = 1)
matrix_20s_centered = matrix_20s - user_mean.reshape(-1, 1)

In [28]:
matrix_20s_centered

matrix([[-5.48491192e-05, -5.48491192e-05, -5.48491192e-05, ...,
         -5.48491192e-05, -5.48491192e-05, -5.48491192e-05],
        [ 0.00000000e+00,  0.00000000e+00,  0.00000000e+00, ...,
          0.00000000e+00,  0.00000000e+00,  0.00000000e+00],
        [-1.46264318e-04, -1.46264318e-04, -1.46264318e-04, ...,
         -1.46264318e-04, -1.46264318e-04, -1.46264318e-04],
        ...,
        [-1.73688878e-04, -1.73688878e-04, -1.73688878e-04, ...,
         -1.73688878e-04, -1.73688878e-04, -1.73688878e-04],
        [-7.31321590e-05, -7.31321590e-05, -7.31321590e-05, ...,
         -7.31321590e-05, -7.31321590e-05, -7.31321590e-05],
        [-8.22736788e-05, -8.22736788e-05, -8.22736788e-05, ...,
         -8.22736788e-05, -8.22736788e-05, -8.22736788e-05]])

In [29]:
# SVD 적용
from scipy.sparse.linalg import svds
U, sigma, V = svds(matrix_20s_centered, k = 9)

Latent Factor를 얻었다.
User에 대해서 유사한 정보를 찾기 위해 U 행렬을 확인하고자 한다.

In [30]:
len(U)

17611

In [31]:
#  best-k 가장 유사한 유저 찾기
def pearson_corr(v1, v2):
    cov = np.cov(v1, v2)[0, 1] # 공분산 행렬로 나오지 않게 설정한다.
    std1 = np.std(v1)
    std2 = np.std(v2)
    return cov / (std1 * std2)

In [32]:
max_corr = -99
max_idx = -1
for i in range(1, len(U)):
    cur_corr = pearson_corr(U[0], U[i])
    if max_corr < cur_corr:
        max_corr = cur_corr
        max_idx = i
print(max_idx)

355

In [33]:
# 355번째 유저를 확인하는 방법
sorted(ratings_20s.user_id.unique())[355]

4875

In [34]:
#id = 10인 유저가 읽지 않았는데 id = 4875가 읽은 책을 확인하기.
id_10_read = ratings_20s.loc[ratings_20s.user_id == 10,:].ISBN
id_4875_read = ratings_20s.loc[ratings_20s.user_id == 4875,:].ISBN

In [35]:
id_4875_read

5171    157586326X
Name: ISBN, dtype: object

In [36]:
books.loc[books.ISBN=='157586326X',:]

,ISBN,title,author,pub_year
5477,157586326X,Things a Computer Scientist Rarely Talks About,Donald E. Knuth,2003

In [37]:
id_10_read

747    1841721522
748    8477024456
Name: ISBN, dtype: object

In [38]:
books.loc[books.ISBN=='1841721522',:]

,ISBN,title,author,pub_year
21,1841721522,New Vegetarian: Bold and Beautiful Recipes for...,Celia Brooks Brown,2001

In [39]:
# 10번이 읽은 책은 컴퓨터책인데, 4875번이 읽은 책은 음식과 관련된 책으로 거리가 멀어 보인다.
# 이를 해결하기 위해, 유저 1명이 대해서가 아닌 가장 가까운 유저 10명이 읽은 책을 확인해보는 방법으로 진행한다.

user_20s_id = sorted(ratings_20s.user_id.unique())
user_20s_corr = []

for i in range(1, len(U)):
    if i == 0:
        user_20s_corr.append(0)
    else:
        user_20s_corr.append(pearson_corr(U[0], U[i]))

In [40]:
# user_20s_id와 user_20s_corr을 dict로 만든 후, corr값을 기준으로 내림차순 정렬을 한다.
# 그 후 최대 5개를 뽑아 recom으로 만든다.

# dict로 만들기 위해 zip를 활용한다.
user_20s_dict = dict(zip(user_20s_id, user_20s_corr))
user_20s_dict = sorted(user_20s_dict.items(), key = (lambda x : x[1]), reverse = True)

In [41]:
picked_id = [i[0] for i in user_20s_dict[0:10]]

In [42]:
picked_id

[4849, 27917, 39745, 56302, 63006, 67513, 78951, 84655, 94865, 106453]

## Item-Based를 위한 준비/탐색

In [43]:
# 우선 작가 하나를 기준으로 도서 리스트를 검색
books.loc[books.author == 'Donald E. Knuth',:]

,ISBN,title,author,pub_year
5477,157586326X,Things a Computer Scientist Rarely Talks About,Donald E. Knuth,2003
117947,020103803X,Art of Computer Programming/Sorting and Search...,Donald E. Knuth,1973
117949,0201038226,"The Art of Computer Programming, Volume 2: Sem...",Donald E. Knuth,1981
129047,0201896834,"Art of Computer Programming, Volume 1: Fundame...",Donald E. Knuth,1997
262305,0201896842,"Art of Computer Programming, Volume 2: Seminum...",Donald E. Knuth,1997
262306,0201896850,"Art of Computer Programming, Volume 3: Sorting...",Donald E. Knuth,1998

In [44]:
# 작가별로, 유의미하게 동일한 컨셉의 책을 주는 것을 알 수 있다.
# 작가의 수를 검색해보자
len(books.author.unique())

102024

## 20대 기준 모델 설계

### 모델 설계 계획  
1. 가장 유사한 유저 10명을 추천 한다.  
2. 10명이 읽은 책을 동일한 ISBN으로 묶어준다.
3. 5권 + 유저가 읽은 책의 작가별로 가장 최신의 책(작가별 최대 5권?)을 선정한다.

이 때, 신규 유저의 취향을 받기 위한 방법으로 신규 유저에게 질문을 받는 방법을 고민해보자.

### 사전 질문 형성 고려

In [45]:
sorted_20s = ratings_20s.groupby(ratings_20s.ISBN).count().sort_values('user_id', ascending = False)
sorted_20s_top10 = sorted_20s.iloc[0:10,:]

In [46]:
# 가장 많이 읽은 10권의 책에 대해 점수를 받고자 한다.
sorted_20s_top10

            user_id  score  gen
ISBN
0971880107      711    711  711
0316666343      253    253  253
0385504209      187    187  187
0679781587      155    155  155
0060928336      151    151  151
0345337662      143    143  143
059035342X      142    142  142
0312195516      133    133  133
0804106304      127    127  127
0316769487      122    122  122

In [47]:
book_top10_title = []
for i in range(0, 10):
    cur_ISBN = sorted_20s_top10.index[i]
    book_top10_title.append(books.loc[books.ISBN == cur_ISBN].title)

In [48]:
book_top10_title

[26    Wild Animus
 Name: title, dtype: object,
 408    The Lovely Bones: A Novel
 Name: title, dtype: object,
 748    The Da Vinci Code
 Name: title, dtype: object,
 Series([], Name: title, dtype: object),
 1105    Divine Secrets of the Ya-Ya Sisterhood: A Novel
 Name: title, dtype: object,
 2526    Interview with the Vampire
 Name: title, dtype: object,
 2143    Harry Potter and the Sorcerer's Stone (Harry P...
 Name: title, dtype: object,
 522    The Red Tent (Bestselling Backlist)
 Name: title, dtype: object,
 67    The Joy Luck Club
 Name: title, dtype: object,
 90    The Catcher in the Rye
 Name: title, dtype: object]

해당 10권을 바탕으로 평점을 먹으려고 했더니 모두 문학작품만 나왔는데  
기타 분야의 도서에 대해서는 고려하기는 어려워보인다.
따라서 연령대별 가장 많이 평가가 이루어진 도서 10개를 선정해서 점수를 질문하는 방식의 모델은 적절하지 않다.

### 상위 10명의 유저 활용

상위 유저가 한명이 아니라 여러명이라면 의미가 있을지를 고민해보자.

In [49]:
# 0번 유저와 유사한 유저 10명
# 위에서 만든 picked_id 활용
# extend를 활용하면 리스트를 그냥 붙여버릴수있다.
# append와는 다르다!
isbn_top10user= []
for i in range(0, 10):
    cur_id = picked_id[i]
    isbn_top10user.extend(ratings_20s.loc[ratings_20s.user_id == cur_id].ISBN)

In [52]:
for i in range(len(isbn_top10user)):
    cur_isbn = isbn_top10user[i]
    print(books.loc[books.ISBN == cur_isbn].title)

5469    Manhattan fliegt.
Name: title, dtype: object
5853    Dark Horse
Name: title, dtype: object
Series([], Name: title, dtype: object)
Series([], Name: title, dtype: object)
79892    Nackt.
Name: title, dtype: object
79890    Die Kindheit eines Chefs. ErzÃ?Â¤hlungen.
Name: title, dtype: object
79889    Anatomie der menschlichen DestruktivitÃ?Â¤t
Name: title, dtype: object
17115    The Diary of an American Au Pair: A Novel
Name: title, dtype: object
556    The Cove
Name: title, dtype: object
34682    Malataverne
Name: title, dtype: object
150894    El Dragon Y LA Princesa
Name: title, dtype: object
150899    Narraciones Extraordinarias - 1: Seleccion
Name: title, dtype: object
Series([], Name: title, dtype: object)
1106    She's Come Undone (Oprah's Book Club (Paperback))
Name: title, dtype: object
25303    On Having No Head: Zen and the Re-Discovery of...
Name: title, dtype: object
178822    \Banjo\" Paterson's high country"
Name: title, dtype: object
18670    The Chocolate War (Laurel Leaf Books)
Name: title, dtype: object
58752    Simple Justice: A Benjamin Justice Mystery (Be...
Name: title, dtype: object
43847    The Physician
Name: title, dtype: object
26    Wild Animus
Name: title, dtype: object
Series([], Name: title, dtype: object)
25306    El Greco Malt Den Grossinquisi
Name: title, dtype: object
174829    Das liebe Geld.
Name: title, dtype: object
178713    Die Insel des vollkommenen GlÃ?Â¼cks.
Name: title, dtype: object
104085    Ibiza - Liebe inbegriffen.
Name: title, dtype: object
120379    Die Erfindung des Abschieds.
Name: title, dtype: object
44684    Niemand sieht dich, wenn du weinst.
Name: title, dtype: object
Series([], Name: title, dtype: object)
143092    Die Umarmung des Todes.
Name: title, dtype: object
104089    Lebenslang ist nicht genug.
Name: title, dtype: object
45992    Der Campus.
Name: title, dtype: object
178781    Popcorn.
Name: title, dtype: object
104090    Die SchnÃ?Â¤ppchenjÃ?Â¤gerin.
Name: title, dtype: object
120378    Amandas Hochzeit.
Name: title, dtype: object
119841    Ich schlieÃ?Â?e mich selbst ein.
Name: title, dtype: object
78013    Ring.
Name: title, dtype: object
178825    HomosexualitÃ¤t des Mannes: Eine tiefenpsychol...
Name: title, dtype: object
55371    Maus 1. Mein Vater kotzt Geschichte aus. Die G...
Name: title, dtype: object
55369    Maus 2. Und hier begann mein UnglÃ?Â¼ck. Die G...
Name: title, dtype: object
178784    Mondscheintarif. Das Buch zum Film
Name: title, dtype: object
178790    Die Kalten Fusse Der Frauen
Name: title, dtype: object
178757    Ã?Â?ber das Fernsehen.
Name: title, dtype: object
Series([], Name: title, dtype: object)
120380    Der Familienschandfleck.
Name: title, dtype: object
120376    Ein Hausfreund kommt selten allein.
Name: title, dtype: object
44669    Cassie.
Name: title, dtype: object
Series([], Name: title, dtype: object)
Series([], Name: title, dtype: object)
13389    Generation Golf: Eine Inspektion
Name: title, dtype: object
Series([], Name: title, dtype: object)
Series([], Name: title, dtype: object)
Series([], Name: title, dtype: object)
4723    Disclosure
Name: title, dtype: object
65297    Are You the One for Me?: Knowing Who's Right a...
Name: title, dtype: object
56996    1001 Ways to Save Money ... and Still Have a D...
Name: title, dtype: object

유저들간의 유사도만으로 비슷한 장르의 책을 추천해주지 않고 있음을 알 수 있다.

## 정리

1. 데이터가 너무 커서 유저별로 연령대를 나누었다.  
2. 유저들간의 유사도를 비교 후 가장 유사한 유저 10명을 추출하여, 그들이 읽은 책들을 몯 확인하였다.
3. 그러나 책의 장르 등을 잘 반영하고 있지 않음을 알 수 있다.
4. 따라서 책의 추천에 있어서 가장 좋은 방법은 유저가 평점을 매긴 책 중 평점이 높은 책의 저자가 쓴 다른 책을 추천해주는 것이다.